<template>
  <div>
    <publicHeads :id="id"></publicHeads>
    <div class="bd">
      <div class="left_nav">
        <ul>
          <li v-for="(item,indexed) in left_list" :class="indexed == listIndex?'':'normal_bc'"
              @click="listIndex = indexed">
            {{item}}
            <i :class="indexed == listIndex?'rightPoint':'rightPoint_nor rightPoint'"></i>
          </li>
        </ul>
      </div>
      <div class="news">
        <p v-for="item in newsMes[id-1][listIndex]">{{item}} </p>
      </div>
    </div>
    <publicEnd></publicEnd>
  </div>
</template>

<script>
    import publicHeads from "../components/publicHeads";
    import publicEnd from "../components/publicEnd";

    export default {
        name: "mesDetail",
        components: {
            publicHeads,
            publicEnd
        },
        data() {
            return {
                left_list: [],
                listIndex: 0,
                id: -1,
                newsMes: [
                    [
                        [
                            '英大培训机构是一家从事职业教育培训，证书考评，职业测评，教育信息发布为一体的专业教育培训机构。',
                            '本机构从成立之日起，就以“致力于为所需人才提供最优质的职业教育培训平台、致力于为所需人才提供高品质的职业测评”为企业' +
                            '的核心使命。凭借先进的教育理念、独具特色的教学模式以及扎实的团队管理迅速发展壮大。经过10年的发展，现已取得了卓越的成就。',
                            '依托优良的师资队伍和对职业教育的深刻见解，长期致力于在社会群体中推广职业测评，职业培训，培养21世纪融会中西最具有竞争力的高职业素质人才。',
                            '公司以职业培训为核心，拥有短期培训体系、中长期培训体系、精英教育培训体系等多个发展平台，集教育培训和职业培训于一体，' +
                            '鼓励所需人群树立坚持、积极、乐观的价值观念，帮助所需人群实现自我激励、自我管理和人际沟通，做爱国爱家，自信果敢的时代青年。自成立之日起，' +
                            '公司面向全国各省开展了数百场职业考评，有数千人参加并从中受益。励志改变人生，奋斗成就梦想，英大培训全体成员祝愿所有朋友们赢得精彩人生!',
                            '公司现已成为河南省本土成长最快、最具行业影响力的品牌职业教育公司之一。'
                        ],
                        [
                            '郑州市金水区农业路6号院11号楼',
                            '河南省珠宝玉石首饰行业协会',
                            '文化路与双铺路E时代广场11号楼'
                        ],
                        [
                            '企业使命；致力于为所需人才提供最优质的职业教育培训平台、致力于为所需人才提供高品质的职业测评。',
                            '核心价值；诚信经营，多方共赢!',
                            '发展理念；以质为根，以诚为本，以德为先，以信为基。',
                            '追求理念；为客户提供更高效大的职业教育服务。'
                        ]
                    ],
                    [
                        [
                            '成人教育是指有别于普通全日制教学形式的教育形式。成人教育不限年龄，性别。通过这个教育过程。',
                            '我司针对成人继续教育推出的学历获得方式有四种，分别是高等教育自学考试(自考)、网络教育(远程教育)、' +
                            '成人高考(学习形式有脱产，业余，函授)、开放大学(原广播电视大学现代远程开放教育)。',
                            '招生对象：',
                            '1、对已经走上工作、生产岗位，或需要转换岗位的人员，以及正在谋求就业的待业者;',
                            '2、对已经离开正规学校的人员，根据他们所具有的文化基础和实际需要，继续进行基础教育或高等教育，合格者可取得相应的毕业证书;',
                            '3、对已经接受过高等教育的专业技术人员和管理人员进行更新和扩展知识、提高能力的继续教育;',
                            '报考流程:',
                            '1、(院校)每年8月初(在网上报考前)各大院校登出招生简章(具体以当年为准)，包括专业招生人数(如:人大，会计 50人)等。' +
                            '届时会公布在各地教育考试院的网站上',
                            '2、(报考)8月中旬开始报考志愿，9月初现场进行确认，各区县确认点届时会公布。(随时关注此网站的报考信息发布)',
                            '3、(考试)每年10月的第二个周末参加全国统一考试，考取理想院校',
                            '4、 (成绩)每年成绩公布时间:考后1个月左右可查询(08年为10月31日)',
                            '院校录取时间为:11月中旬至12月底',
                            '院校入学通知:次年2月底至3月初左右。'
                        ],
                        [
                            '远程教育，在教育部已出台的一些文件中，也称现代远程教育为网络教育，是成人教育学历中的一种。是指使用电视及互联网等' +
                            '传播媒体的教学模式，招生对象不受年龄和先前学历限制，为广大已步入社会的群众提供了学历提升的机会。',
                            '报名材料',
                            '报名网络教育本科有以下两种情况：一是考生通过高起点报考本科，二是专科起点报考远程教育本科。高起点考生需具有高中文化程度，' +
                            '如中专、高职院校或应届高中毕业生。专科起点考生报考时需具有国民教育系列大专文凭。报考远程教育本科时，考生需持本人身份证或户口簿、' +
                            '高中（相关毕业证书）或大专国民教育系列文凭原件及以上复印件2分、一寸照片两张到指定的学习中心进行报名、缴费。' +
                            '远程教育每年分为春秋两季招生，春季考生可在每年2月底前报名，秋季考生可在每年8月底前报名。' +
                            '远程教育本科无论是高起点还是专科起点都需要参加全国统考（全称为现代远程教育试点高校网络教育学生部分公共基础课全国统一考试），' +
                            '完成相应学习计划，达到毕业要求者方可毕业，对于达到学士学位条件者可获得学士学位证。',
                            '网络教育随时随地想学就学的学习方式很大程度上为学员节省了很多时间，工作繁忙、学习时间不固定的上班族的喜爱，' +
                            '在基础远程教育中也广受欢迎。网络教育招生院校均为国内重点大学、211工程、985工程建设院校，设置专业均为就业前景良好的热门专业，' +
                            '其注重实用性，很受用人单位欢迎。每年我国远程教育试点院校培养了大批远程本科毕业生，他们其中很多都从事于大小型企业的管理或重要岗位。',
                            '院校名单',
                            '北京大学、中国人民大学、清华大学*、北京交通大学、北京航空航天大学、北京理工大学、北京科技大学、北京邮电大学、中国农业大学、' +
                            '北京中医药大学、北京师范大学、北京外国语大学、北京语言大学、中国传媒大学、对外经济贸易大学、中国科学技术大学、' +
                            '中央音乐学院、南开大学、天津大学、大连理工大学、东北大学、中国医科大学、东北财经大学、吉林大学、东北师范大学、' +
                            '哈尔滨工业大学、东北农业大学、复旦大学、上海交通大学(含医学院)、华东理工大学、东华大学、华东师范大学、上海外国语大学、' +
                            '南京大学、东南大学、江南大学、浙江大学、厦门大学、福建师范大学、山东大学、中国石油大学(华东)、郑州大学、武汉大学、华中科技大学、' +
                            '中国地质大学(武汉)、武汉理工大学、华中师范大学、湖南大学、中南大学、中山大学、华南理工大学、华南师范大学、四川大学、重庆大学、' +
                            '西南交通大学、电子科技大学、西南科技大学、四川农业大学、西南大学、西南财经大学、西安交通大学、西北工业大学、西安电子科技大学、' +
                            '陕西师范大学、兰州大学、中国石油大学(北京)、中国地质大学(北京)、中央广播电视大学。'
                        ],
                        [
                            '职业教育包括职业学校教育和职业培训。职业学校教育包括各种职业技术学校、技工学校、职业高中(职业中学)等。职业学校教育是学历性的教育，' +
                            '分为初等、中等和高等职业学校教育。职业培训包括对职工的就业前培训、对下岗职工的再就业培训等各种职业培训。',
                            '据统计，2005年全国仅有中等职业学校11611所，当年招生537.29万人，在校学生1324.74万人。经过3年发展，2008年全国中等职业学校共有14767所，' +
                            '招生规模达810万人，在校生达2056万人。中等职业教育与普通高中教育招生规模已大体相当。',
                            '"工学结合、校企合作、顶岗实习"的模式，成了我国职业学校，尤其是中职学校毕业生高就业率的秘诀。',
                            '教育部公布的统计数据显示，自2005年起，全国中等职业学校毕业生平均就业率连续5年保持在95%以上。2008年及2009年，' +
                            '尽管国际金融风暴使许多人就业困难，全国中等职业学校毕业生的平均就业率仍没有回落，分别高达95.77%和 95.99%。',
                            '2012年6月11日，国务院新闻办公室发布《国家人权行动计划(2012-2015年)》，2012~2015年期间我国将大力发展职业教育。' +
                            '保持中等职业教育和普通高中招生规模大体相当。扶持建设紧贴产业需求、校企深度融合的专业，建设既有基础理论知识和教学能力，' +
                            '又有实践经验和技能的师资队伍。逐步实行免费中等职业教育。',
                            '中国正在举办世界上规模最大的职业教育。2008年职业院校的招生规模总数已经达到1100万人，在校学生总数已超过3000万人。' +
                            '中等职业教育和高等职业教育分别占据了高中阶段和高等教育的一半。',
                            '为贯彻执行国家政策方针我司推出安监局特种工、质监局特种工、轻工技能鉴定、住建部技能工、交通技能鉴定、工信技能鉴定、' +
                            '卫生技能鉴定、农业技能鉴定等职业技能学习与鉴定考核。',
                        ]
                    ],
                    [
                        [
                            '我司推出成人教育，远程教育，职业教育，普通话，安监局特种工，质监局特种工，轻工技能鉴定、住建部技能工、' +
                            '交通技能鉴定、工信技能鉴定、卫生技能鉴定、农业技能鉴定培训考试',
                        ],
                        [
                            '自学考试，1981年经国务院批准创立，是对社会人员以学历考试为主的高等教育国家考试。是个人自学、社会助学和国家考试相结合的高等教育形式。',
                            '通过国家考试促进广泛的个人自学和社会助学活动，贯彻宪法鼓励自学成材的有关规定，造就和选拔德才兼备的专门人才，提高全民族的思想道德素质和科学文化素质，' +
                            '以适应社会主义现代化建设的需要。 经过系统的学习后，通过毕业论文答辩、学位英语考核达到规定成绩，符合学位申请条件的，' +
                            '可申请授予成人学士学位，并可继续攻读硕士学位和博士学位。',
                            '报考人员条件',
                            '1.遵守中华人民共和国宪法和法律。',
                            '2.国家承认学历的各类高、中等学校在校生以外的在职、从业人员和社会其他人员。',
                            '3.身体健康，生活能自理，不影响所报专业学习。',
                            '4.报考高中起点升本科或高中起点升专科的考生应具有高中文化程度。',
                            '5.报考专科起点升本科的考生必须是已取得经教育部审定核准的国民教育系列高等学校、高等教育自学考试机构颁发的专科毕业证书、' +
                            '本科肄业证书或以上证书的人员。',
                            '6.党校及干部函授大学专科毕业人员，不具备参加本科段考试的资格。',
                            '7.参加本科段考试的考生，应持专科毕业证书和本人身份证到当地该专业的报名点报名。报考与所学专科专业不同的本科，' +
                            '根据专业的不同需要加试相应的课程',
                            '报名时间：自学考试每年一般考4次，分别为1月、4月、7月和10月，各地自考报名时间不相同，一般在考前一个月左右报名。',
                            '考试时间：全国自学考试时间一般如下：各省时间可能有微调，如上海地区部分专业5月、11月也安排考试，建议考生考前咨询当地自考办。'
                        ]
                    ]
                ]
            }
        },
        watch: {
            $route() {
                this.listIndex = 0
                this.id = this.$route.meta.index
                this.left_list = [...this.$route.meta.list]
            }
        },
        created() {
            this.id = this.$route.meta.index
            this.left_list = [...this.$route.meta.list]
        }
    }
</script>

<style scoped>
  .bd {
    width: 1200px;
    margin: 0 auto;
    display: flex;
  }

  ul li:hover {
    cursor: pointer;
  }

  ul li {
    line-height: 80px;
    background-color: #3899D5;
    border: 1px solid #3899D5;
    border-radius: 6px;
    width: 250px;
    text-align: center;
    color: #FFFFFF;
    margin: 10px;
    font-size: 26px;
  }

  .rightPoint {
    display: inline-block;
    border: 11px solid #3899D5;
    border-left: 11px solid white;
    position: relative;
    right: -45px;
    top: 2px;
  }

  .news p {
    margin-bottom: 20px;
    text-indent: 40px;
    font-size: 20px;
  }

  .normal_bc {
    background-color: white;
    color: #3899D5;
  }

  .rightPoint_nor {
    border: 11px solid white;
    border-left: 11px solid #3899D5;
  }

  .news {
    border-left: 1px solid #3899D5;
    margin: 10px 0 10px 40px;
    padding: 20px 20px 100px;
  }
</style>
